import { useEffect } from "react"
import { useHistory } from "react-router";

function AnalisisEspera() {
  const history = useHistory() 
  setTimeout(() => history.push("/HomeSerps/ResultadoAnalisis"), 500)
  return (
    <div className="bg-gray-200 h-screen relative">
      <div className="absolute pt-20 pl-24 pb-4 pr-4 h-full w-full">
        <div className="bg-white h-full flex flex-col p-4 justify-center items-center">
          <svg
            width="331"
            height="307"
            viewBox="0 0 331 307"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <circle opacity="0.1" cx="211" cy="120" r="120" fill="#2D72C9" />
            <path
              opacity="0.1"
              d="M111.942 195.645C149.867 213.884 195.397 197.925 213.636 160C231.874 122.074 215.915 76.5447 177.99 58.3061C140.065 40.0675 94.535 56.0267 76.2964 93.9519C58.0578 131.877 74.017 177.407 111.942 195.645Z"
              fill="#3E6BAB"
            />
            <path
              d="M200.218 82.766C176.047 52.2768 131.742 47.1549 101.252 71.3261C70.7631 95.4972 65.6413 139.803 89.8125 170.292C113.984 200.781 158.289 205.903 188.778 181.732C219.247 157.603 224.389 113.255 200.218 82.766ZM95.5248 165.735C73.8805 138.405 78.4593 98.7254 105.789 77.0811C133.119 55.4368 172.798 60.0156 194.443 87.3453C216.087 114.675 211.508 154.355 184.178 175.999C156.891 197.664 117.169 193.064 95.5248 165.735Z"
              fill="white"
            />
            <path
              d="M193.954 190.013C229.361 161.954 234.748 110.104 205.385 75.3313C179.042 44.1131 131.628 37.9165 98.1629 61.3921C62.4969 86.3842 53.8289 134.239 76.1707 169.734L4.8339 226.285C2.90817 227.776 2.61234 230.576 4.10348 232.502L9.5683 239.387C11.0594 241.312 13.8599 241.608 15.7857 240.117L87.1225 183.566C115.503 212.296 161.539 215.676 193.954 190.013ZM91.283 169.014C67.9104 139.487 72.8639 96.6247 102.348 73.2316C131.875 49.859 174.738 54.8123 198.131 84.2968C221.524 113.781 216.55 156.686 187.066 180.08C157.581 203.473 114.676 198.499 91.283 169.014Z"
              fill="#3E6BAB"
            />
          </svg>
          <p className="text-2xl opacity-50 font-sans">
            El análisis se está realizando...
          </p>
        </div>
      </div>
    </div>
  );
}

export default AnalisisEspera;
